app/controllers/articles_controller.rb

UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "asdasdasdadasdadasd"], ["updated_at", "2020-05-01 18:56:20.204119"], ["id", 4]]
---
    def update
        @article = get_article_by_id

        if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
    def destroy
        @article = get_article_by_id
        @article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        def get_article_by_id
            Article.find(params[:id])