app/controllers/comments_controller.rb

    def create
        @comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Best"], ["body", "betts"], ["article_id", 1], ["created_at", "2020-05-01 05:16:33.303657"], ["updated_at", "2020-05-01 05:16:33.303657"]]

    def destroy
        @comment = @article.comments.find(params[:id])
        @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]

        def get_article_by_id
            @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]